OdDAI.ApplicationInstance.getDynamicAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves inverse or derived attribute value.

OdDAI.ApplicationInstance.getDerivedAttr(OdDAI.DerivedAttribute*)
\details
Evaluates an expression to retrieve derived attribute value and returns it.

OdDAI.ApplicationInstance.findUsedIn(OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Retrieves the identifiers of all the entity instances in the model data
that reference the curent entity instance by the specified attribute.
\param role [in] Identifier of the attribute as the role being requested.
\param resultList [in/out]  Identifier of the pre-existing NPL to which the
identifiers of the entity instances referencing the current instance by
the specified attribute are added.
\returns Identifier of the result NPL.

OdDAI.ApplicationInstance.findUsedInBN(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Retrieves the identifiers of all the entity instances in the model data
that reference the curent entity instance by the specified attribute name.
\param roleName [in] A string that contains a fully qualified attribute name, i.e.
ifcplacement.location.
\param resultList [in/out]  Identifier of the pre-existing NPL to which the
identifiers of the entity instances referencing the current instance by
the specified attribute name are added.
\returns Identifier of the result NPL.

OdDAI.ApplicationInstance.findUsers(OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Retrieves the identifiers of all the entity instances in the model
that reference the current entity instance.
\param resultList [in/out]  Identifier of the pre-existing NPL to which the
identifiers of the entity instances referencing the current instance by any
attribute are added.
\returns Identifier of the result NPL.

OdDAI.ApplicationInstance.findRolesOf(OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Retrieves the identifiers of the attributes of entity instances referencing
the curent entity instance.
\param resultList [in/out] Identifier of the pre-existing NPL to which the
attribute identifiers of the entity instances referencing the current instance
are added.
\returns Identifier of the result NPL.

OdDAI.ApplicationInstance.findDataTypes(OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Retrieves the identifiers of the Named/Defined data types of entity instances
of which the specified entity instance is a member according to the schema
types hierarchy.
\param resultList [in/out] Identifier of the pre-existing NPL to which the
Named/Defined type instance identifiers for those instances are added
meeting the specified criteria.
\returns Identifier of the result NPL.

OdDAI.ApplicationInstance.getDerivedAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Calculates a value of a derived attribute specified by its name.
\param attrName [in] An ANSI string that contains the derived attribute name.
\returns Returns the calculated value of the attribute.
\remarks
The method provides the late binding access to the derived attribute value
by its name.

OdDAI.ApplicationInstance.validateStringWidth(OdArray&lt;OdDAI.Attribute**,OdObjectsAllocator&lt;OdDAI.Attribute**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the instance has string attributes with incorrect width and retrieves the list of such attributes.
\param aggr [out] An array of pointers to Attribute instances which have incorrect width for the application instance.
\returns True if all attribute string values are of correct width, false if width constraint is violated, and Unknown if expression
evaluation value is unknown or indeterminate.

OdDAI.ApplicationInstance.validateAggrSize(OdArray&lt;OdDAI.Attribute**,OdObjectsAllocator&lt;OdDAI.Attribute**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the instance has aggregate attributes violating size constraints and retrieves the list of such attributes.
\param aggr [out] An array of pointers to Attribute instances which are violating size constarints for the application instance.
\returns True if validation is satisfied, false if constraint is violated, and Unknown if expression
evaluation value is unknown or indeterminate.

OdDAI.ApplicationInstance.validateWhereRule(OdDAI.WhereRule!System.Runtime.CompilerServices.IsConst*)
\details
Checks application instance against where rule of its entity definititon and parent entity
definitions.
\param ruleDef [in] A smart pointer to rule definition.
\returns True if rule is satisfied, false if rule is violated, and Unknown if rule expression
evaluation value is unknown or indeterminate.

OdDAI.ApplicationInstance.validateWhereRule(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Checks application instance against where rule of its entity definititon and parent entity
definitions.
\param ruleName [in] A name of Where Rule for validation.
\returns True if rule is satisfied, false if rule is violated, and Unknown if rule expression
evaluation value is unknown or indeterminate.

OdDAI.ApplicationInstance.validateInverseAttrs(OdArray&lt;OdDAI.InverseAttribute**,OdObjectsAllocator&lt;OdDAI.InverseAttribute**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the instance has inverse attributes with unsatisfied size constraints and retrieves the list of such attributes.
\param aggr [out] An array of pointers to InverseAttribute instances which have unsatisfied size constraints for the application instance.
\returns
true if all inverse attributes constraints are satisfied or if the instance has no inverse attributes; otherwise, the method returns false.

OdDAI.ApplicationInstance.validateRequiredExplicitAttrsAssigned(OdArray&lt;OdDAI.ExplicitAttribute**,OdObjectsAllocator&lt;OdDAI.ExplicitAttribute**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the instance has unset mandatory attributes and retrieves the list of such attributes.
\param unsetAttrs [out] An array of pointers to ExplicitAttribute instances which are unset for the application instance.
\returns
true if all mandatory attributes of an instance are set; the method returns false if at least one mandatory attribute of an instance is unset.

OdDAI.ApplicationInstance.copyFrom(OdRxObject!System.Runtime.CompilerServices.IsConst*)
details
Copies the contents of the specified object into this object.
\param pSource [in] Pointer to the source object.
\remarks
The default implementation of this function does nothing but throws the eNotApplicable exception.

OdDAI.ApplicationInstance.unsetAttr(OdSmartPtr&lt;OdDAI.Attribute&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Clears the attribute value.
\param attribute [in] attribute to unset.

OdDAI.ApplicationInstance.unsetAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Clears the attribute value.
\param explicitAttrName [in] An ANSI string that contains the attribute name.

OdDAI.ApplicationInstance.unsetAttrCaseInsensitive(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset in the case insensitive mode.
\param attribute [in] an attribute type.
\returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.ApplicationInstance.putAttrCaseInsensitive(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value of an attribute that is specified by its name in the case insensitive mode.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\param val              [in] A new attribute value to be set.
\returns true if the attribute value was successfully set; otherwise, the method returns false.

OdDAI.ApplicationInstance.putAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value of an attribute that is specified by its name.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\param val              [in] A new attribute value to be set.
\returns true if the attribute value was successfully set; otherwise, the method returns false.

OdDAI.ApplicationInstance.testAttr(OdSmartPtr&lt;OdDAI.Attribute&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves whether the attribute value is set or is unset.
\param attribute [in] an attribute type.
\returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.ApplicationInstance.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.ApplicationInstance.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns The current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.